tests/resources/directpayment/doAuthorizationRedirect/doAuthorizationRedirectRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com" xmlns:ns2="http://obj.ws.payline.experian.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:doAuthorizationRedirectRequest>
            <ns1:version/>
            <ns1:payment>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:action>100</ns2:action>
                <ns2:mode>NX</ns2:mode>
                <ns2:contractNumber>CB</ns2:contractNumber>
                <ns2:differedActionDate>DiffActDate 11/11/2011</ns2:differedActionDate>
                <ns2:method>Method</ns2:method>
                <ns2:softDescriptor xsi:nil="true"/>
                <ns2:cardBrand>VISA</ns2:cardBrand>
                <ns2:registrationToken xsi:nil="true"/>
                <ns2:cumulatedAmount xsi:nil="true"/>
            </ns1:payment>
            <ns1:card>
                <ns2:encryptionKeyId xsi:nil="true"/>
                <ns2:encryptedData xsi:nil="true"/>
                <ns2:number>4444333322221111</ns2:number>
                <ns2:type>CB</ns2:type>
                <ns2:expirationDate>1235</ns2:expirationDate>
                <ns2:cvx>123</ns2:cvx>
                <ns2:ownerBirthdayDate xsi:nil="true"/>
                <ns2:password xsi:nil="true"/>
                <ns2:cardPresent xsi:nil="true"/>
                <ns2:cardholder>Marcel Patoulatchi</ns2:cardholder>
                <ns2:token xsi:nil="true"/>
                <ns2:par xsi:nil="true"/>
                <ns2:tokenRequestorCryptogram xsi:nil="true"/>
                <ns2:tokenRequestorId xsi:nil="true"/>
                <ns2:last4 xsi:nil="true"/>
                <ns2:panType xsi:nil="true"/>
            </ns1:card>
            <ns1:returnURL/>
            <ns1:cancelURL/>
            <ns1:order>
                <ns2:ref>myOrderRef_35656</ns2:ref>
                <ns2:origin>BIGBANG</ns2:origin>
                <ns2:country>FRANCE</ns2:country>
                <ns2:taxes>50%</ns2:taxes>
                <ns2:amount>1000</ns2:amount>
                <ns2:currency>978</ns2:currency>
                <ns2:date>15/12/2014 12:20</ns2:date>
                <ns2:details/>
                <ns2:deliveryTime>entre 6h et 22h</ns2:deliveryTime>
                <ns2:deliveryMode>Par camion</ns2:deliveryMode>
                <ns2:deliveryExpectedDate>Demain</ns2:deliveryExpectedDate>
                <ns2:deliveryExpectedDelay>200</ns2:deliveryExpectedDelay>
                <ns2:deliveryCharge>DeliveryChareg 8</ns2:deliveryCharge>
                <ns2:discountAmount xsi:nil="true"/>
                <ns2:otaPackageType xsi:nil="true"/>
                <ns2:otaDestinationCountry xsi:nil="true"/>
                <ns2:bookingReference>BookingRef ppp</ns2:bookingReference>
                <ns2:orderDetail>OrderDetails 9999</ns2:orderDetail>
                <ns2:orderExtended xsi:nil="true"/>
                <ns2:orderOTA>OrderOTA supp</ns2:orderOTA>
            </ns1:order>
            <ns1:notificationURL xsi:nil="true"/>
            <ns1:privateDataList/>
            <ns1:languageCode xsi:nil="true"/>
            <ns1:buyer>
                <ns2:title>Maitre de lunivers</ns2:title>
                <ns2:lastName>lastname</ns2:lastName>
                <ns2:firstName>firstname </ns2:firstName>
                <ns2:email>toto@fait.dubateau </ns2:email>
                <ns2:shippingAdress>
                    <ns2:title>Maitre de lunivers</ns2:title>
                    <ns2:name>name shipping</ns2:name>
                    <ns2:firstName>firstname shipping</ns2:firstName>
                    <ns2:lastName>lastnameshipping</ns2:lastName>
                    <ns2:street1>123 rue de nowhere</ns2:street1>
                    <ns2:street2>Street 2 nowhere</ns2:street2>
                    <ns2:streetNumber>999</ns2:streetNumber>
                    <ns2:cityName>city shipping</ns2:cityName>
                    <ns2:zipCode>11000</ns2:zipCode>
                    <ns2:country>FR</ns2:country>
                    <ns2:phone>000000000</ns2:phone>
                    <ns2:state>LA</ns2:state>
                    <ns2:county>FR</ns2:county>
                    <ns2:phoneType>Nokia3310 shipping</ns2:phoneType>
                    <ns2:addressCreateDate>00/00/0000</ns2:addressCreateDate>
                    <ns2:email>toto@fait.dubateau shipping</ns2:email>
                </ns2:shippingAdress>
                <ns2:billingAddress>
                    <ns2:title>Maitre de lunivers</ns2:title>
                    <ns2:name>name billing</ns2:name>
                    <ns2:firstName>firstname billing</ns2:firstName>
                    <ns2:lastName>lastnamebilling</ns2:lastName>
                    <ns2:street1>123 rue de nowhere</ns2:street1>
                    <ns2:street2>Street 2 nowhere</ns2:street2>
                    <ns2:streetNumber>999</ns2:streetNumber>
                    <ns2:cityName>city billing</ns2:cityName>
                    <ns2:zipCode>11000</ns2:zipCode>
                    <ns2:country>FR</ns2:country>
                    <ns2:phone>000000000</ns2:phone>
                    <ns2:state>LA</ns2:state>
                    <ns2:county>FR</ns2:county>
                    <ns2:phoneType>Nokia3310 billing</ns2:phoneType>
                    <ns2:addressCreateDate>00/00/0000</ns2:addressCreateDate>
                    <ns2:email>toto@fait.dubateau billing</ns2:email>
                </ns2:billingAddress>
                <ns2:accountCreateDate xsi:nil="true"/>
                <ns2:accountAverageAmount xsi:nil="true"/>
                <ns2:accountOrderCount xsi:nil="true"/>
                <ns2:walletId>xxx222</ns2:walletId>
                <ns2:walletDisplayed>Wallet XX</ns2:walletDisplayed>
                <ns2:walletSecured xsi:nil="true"/>
                <ns2:walletCardInd>2</ns2:walletCardInd>
                <ns2:ip>127.0.0.69</ns2:ip>
                <ns2:mobilePhone>060000000</ns2:mobilePhone>
                <ns2:customerId>customerId</ns2:customerId>
                <ns2:legalStatus>pacs</ns2:legalStatus>
                <ns2:legalDocumentType>papier</ns2:legalDocumentType>
                <ns2:legalDocument>le papier</ns2:legalDocument>
                <ns2:birthDate>01/01/1900</ns2:birthDate>
                <ns2:fingerprintID>aaa-aaa-aaa</ns2:fingerprintID>
                <ns2:deviceFingerprint>deviceFingerprint</ns2:deviceFingerprint>
                <ns2:isBot>true</ns2:isBot>
                <ns2:isIncognito>true</ns2:isIncognito>
                <ns2:isBehindProxy>true</ns2:isBehindProxy>
                <ns2:isFromTor>true</ns2:isFromTor>
                <ns2:isEmulator>true</ns2:isEmulator>
                <ns2:isRooted>true</ns2:isRooted>
                <ns2:hasTimezoneMismatch>jesaispas</ns2:hasTimezoneMismatch>
                <ns2:loyaltyMemberType>true</ns2:loyaltyMemberType>
                <ns2:buyerExtended>buyerExt</ns2:buyerExtended>
                <ns2:merchantAuthentication>
                    <ns2:method xsi:nil="true"/>
                    <ns2:date xsi:nil="true"/>
                </ns2:merchantAuthentication>
            </ns1:buyer>
            <ns1:owner>
                <ns2:lastName xsi:nil="true"/>
                <ns2:firstName xsi:nil="true"/>
                <ns2:billingAddress xsi:type="ns2:billingAddress">
                    <street/>
                    <cityName/>
                    <zipCode/>
                    <country/>
                    <phone/>
                </ns2:billingAddress>
                <ns2:issueCardDate xsi:nil="true"/>
            </ns1:owner>
            <ns1:securityMode xsi:nil="true"/>
            <ns1:recurring>
                <ns2:firstAmount>30</ns2:firstAmount>
                <ns2:amount>100</ns2:amount>
                <ns2:billingCycle>12</ns2:billingCycle>
                <ns2:billingLeft>20</ns2:billingLeft>
                <ns2:billingDay>5</ns2:billingDay>
                <ns2:startDate>01/01/2020 10:00</ns2:startDate>
                <ns2:endDate>01/01/2122 10:00</ns2:endDate>
                <ns2:newAmount>40000</ns2:newAmount>
                <ns2:amountModificationDate>02/01/2020 10:00</ns2:amountModificationDate>
                <ns2:billingRank>12</ns2:billingRank>
            </ns1:recurring>
            <ns1:merchantName xsi:nil="true"/>
            <ns1:subMerchant>
                <ns2:subMerchantId/>
                <ns2:subMerchantName xsi:nil="true"/>
                <ns2:subMerchantMCC/>
                <ns2:subMerchantSIRET xsi:nil="true"/>
                <ns2:subMerchantTaxCode xsi:nil="true"/>
                <ns2:subMerchantStreet xsi:nil="true"/>
                <ns2:subMerchantCity xsi:nil="true"/>
                <ns2:subMerchantZipCode xsi:nil="true"/>
                <ns2:subMerchantCountry xsi:nil="true"/>
                <ns2:subMerchantState xsi:nil="true"/>
                <ns2:subMerchantEmailAddress xsi:nil="true"/>
                <ns2:subMerchantPhoneNumber xsi:nil="true"/>
            </ns1:subMerchant>
            <ns1:miscData xsi:nil="true"/>
            <ns1:asynchronousRetryTimeout xsi:nil="true"/>
        </ns1:doAuthorizationRedirectRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>